from telegram import InlineKeyboardMarkup, InlineKeyboardButton
from bot import SUPPORT_CHANNEL

# Сообщение об ошибке с кнопкой
ERROR = f"""⛔️ <b>Кажется Вы не подписаны на 9 Жизней</b>

Скорее исправляйте ситуацию, подписывайтесь 👉 @{SUPPORT_CHANNEL}

😻 <b>И становитесь участниками мега-конкурса</b>"""

# Сообщение при старте
START_MESSAGE = """
🙌 Добро пожаловать в КотБот <b>9 Жизней</b>

Мы производим супер качественную экипировку для СВО с 2022 года 🤝 потому что нам не все равно!

А сейчас предлагаем поучаствовать в розыгрыше 10 антидроновых накидок <a href='http://t.me/shop_9lifes_bot/nevidimka'>NEVIDIMKA</a> 🙀

🐱 Условия очень простые - подпишитесь на канал <a href='https://t.me/ztmvta'><b>9 Жизней | Тактическое снаряжение</b></a>

"""